### DataFrame 연결/통합
- 연결
    - pandas.concat()       : 함수
    - DataFrame.append()    : 메서드 없어짐
    - DataFrame.merge()     : 메서드

In [1]:
import pandas as pd

In [2]:
data1 = [[11, 22, 33], [44, 55, 66]]
data2 = [[20, 21, 22], [23, 24, 25]]

In [3]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [8]:
# DF 연결
# - 함수사용, 기본값이 행방향 연결, ignore_index 기존의 인덱스 무시
df_12 = pd.concat([df1, df2], ignore_index=True)
df_12

    0   1   2
0  11  22  33
1  44  55  66
2  20  21  22
3  23  24  25

In [11]:
df_12 = pd.concat([df1, df2], axis=1, ignore_index=True)
df_12

    0   1   2   3   4   5
0  11  22  33  20  21  22
1  44  55  66  23  24  25

In [12]:
# DF 연결
# - 컬럼 수 컬럼 이름이 다른 경우
df3 = pd.DataFrame(data2, index=[0, 2], columns=[0, 2, 4])

In [13]:
df3

    0   2   4
0  20  21  22
2  23  24  25

In [15]:
# 기본 행방향 연결 axis =0, join='auter'(합집합)
df_13 = pd.concat([df1, df3], ignore_index=True)
df_13

    0     1   2     4
0  11  22.0  33   NaN
1  44  55.0  66   NaN
2  20   NaN  21  22.0
3  23   NaN  24  25.0

In [17]:
df_13 = pd.concat([df1, df3], join='inner', ignore_index=True, axis=1)  # 교집합
df_13

    0   1   2   3   4   5
0  11  22  33  20  21  22

In [18]:
# DF 연결 - 메서드 사용
df1.merge(df2)

Empty DataFrame
Columns: [0, 1, 2]
Index: []